## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.virtual_machines["lani1"].azurerm_dns_a_record.game_record will be created
  + resource "azurerm_dns_a_record" "game_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "lani1"
      + records             = (known after apply)
      + resource_group_name = "cs2-servers"
      + ttl                 = 300
      + zone_name           = "pelit.ruut.me"
    }

  # module.virtual_machines["lani1"].azurerm_linux_virtual_machine.game will be created
  + resource "azurerm_linux_virtual_machine" "game" {
      + admin_username                                         = "adminuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = true
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "swedencentral"
      + max_bid_price                                          = -1
      + name                                                   = "lani1"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "cs2-servers"
      + size                                                   = "Standard_D4as_v4"
      + user_data                                              = (sensitive value)
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + admin_ssh_key {
          + public_key = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCvY9YBkn72I68uqx4xBElJaZNW/J69Yt/UcS6cGUKUjc5JVs4qYW5Mpn/c4gDWqeSupTb1DAb0sK50kSX+wUCqZH1P6RCSzM8/1rs2kwRcNvNEtqc8/S0hvz9aQunmBft/8YgmhvYGQiboUNkZQAWVlyvCS3lcDBdcq0YUzi4TAz35EcxlGsP2uTCuUGYpgsHIwYNvMYnRlOAzLXKszYf7xL1kwMz4xQDXZh+ggP2prcVCIRnaOBL18aiqaI+QLiVYZpx0qHRaMj2nvJ5goynus1iulrY3R0wmz8e6KkyGI4TfM+yoj0RKl9hfmq1jcXb+aer507s0l8tIqp26BLFQJv1vZjAIWiJ090C6dr/zkgKRVTh0+FsVEWxgC7O0epaUPTN0+Oxpi2itsW8TIm/rteturACLEcTza81ZUHbXZh38OzUaU0SaVpCPmOLn9F4rBXD6QkgWNdjOV8i+0A4u0/xFC1J1rmpINIJOe/llWK6+qkndIcN+4IlVg6Fw4IU= ekos@DESKTOP-QIMMA0H"
          + username   = "adminuser"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 50
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }
    }

  # module.virtual_machines["lani1"].azurerm_network_interface.game will be created
  + resource "azurerm_network_interface" "game" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "swedencentral"
      + mac_address                   = (known after apply)
      + name                          = "lani1-game-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "cs2-servers"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/cs2-servers/providers/Microsoft.Network/virtualNetworks/cs-network/subnets/internal"
        }
    }

  # module.virtual_machines["lani1"].azurerm_network_interface_security_group_association.example will be created
  + resource "azurerm_network_interface_security_group_association" "example" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/cs2-servers/providers/Microsoft.Network/networkSecurityGroups/allow_cs_connections"
    }

  # module.virtual_machines["lani1"].azurerm_public_ip.game will be created
  + resource "azurerm_public_ip" "game" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "swedencentral"
      + name                    = "lani1PublicIp1"
      + resource_group_name     = "cs2-servers"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
      + tags                    = {
          + "hostName" = "lani1"
        }
    }

  # module.virtual_machines["lani2"].azurerm_dns_a_record.game_record will be created
  + resource "azurerm_dns_a_record" "game_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "lani2"
      + records             = (known after apply)
      + resource_group_name = "cs2-servers"
      + ttl                 = 300
      + zone_name           = "pelit.ruut.me"
    }

  # module.virtual_machines["lani2"].azurerm_linux_virtual_machine.game will be created
  + resource "azurerm_linux_virtual_machine" "game" {
      + admin_username                                         = "adminuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = true
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "swedencentral"
      + max_bid_price                                          = -1
      + name                                                   = "lani2"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "cs2-servers"
      + size                                                   = "Standard_D4as_v4"
      + user_data                                              = (sensitive value)
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + admin_ssh_key {
          + public_key = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCvY9YBkn72I68uqx4xBElJaZNW/J69Yt/UcS6cGUKUjc5JVs4qYW5Mpn/c4gDWqeSupTb1DAb0sK50kSX+wUCqZH1P6RCSzM8/1rs2kwRcNvNEtqc8/S0hvz9aQunmBft/8YgmhvYGQiboUNkZQAWVlyvCS3lcDBdcq0YUzi4TAz35EcxlGsP2uTCuUGYpgsHIwYNvMYnRlOAzLXKszYf7xL1kwMz4xQDXZh+ggP2prcVCIRnaOBL18aiqaI+QLiVYZpx0qHRaMj2nvJ5goynus1iulrY3R0wmz8e6KkyGI4TfM+yoj0RKl9hfmq1jcXb+aer507s0l8tIqp26BLFQJv1vZjAIWiJ090C6dr/zkgKRVTh0+FsVEWxgC7O0epaUPTN0+Oxpi2itsW8TIm/rteturACLEcTza81ZUHbXZh38OzUaU0SaVpCPmOLn9F4rBXD6QkgWNdjOV8i+0A4u0/xFC1J1rmpINIJOe/llWK6+qkndIcN+4IlVg6Fw4IU= ekos@DESKTOP-QIMMA0H"
          + username   = "adminuser"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 50
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }
    }

  # module.virtual_machines["lani2"].azurerm_network_interface.game will be created
  + resource "azurerm_network_interface" "game" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "swedencentral"
      + mac_address                   = (known after apply)
      + name                          = "lani2-game-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "cs2-servers"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/cs2-servers/providers/Microsoft.Network/virtualNetworks/cs-network/subnets/internal"
        }
    }

  # module.virtual_machines["lani2"].azurerm_network_interface_security_group_association.example will be created
  + resource "azurerm_network_interface_security_group_association" "example" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/cs2-servers/providers/Microsoft.Network/networkSecurityGroups/allow_cs_connections"
    }

  # module.virtual_machines["lani2"].azurerm_public_ip.game will be created
  + resource "azurerm_public_ip" "game" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "swedencentral"
      + name                    = "lani2PublicIp1"
      + resource_group_name     = "cs2-servers"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
      + tags                    = {
          + "hostName" = "lani2"
        }
    }

  # module.virtual_machines["lani3"].azurerm_dns_a_record.game_record will be created
  + resource "azurerm_dns_a_record" "game_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "lani3"
      + records             = (known after apply)
      + resource_group_name = "cs2-servers"
      + ttl                 = 300
      + zone_name           = "pelit.ruut.me"
    }

  # module.virtual_machines["lani3"].azurerm_linux_virtual_machine.game will be created
  + resource "azurerm_linux_virtual_machine" "game" {
      + admin_username                                         = "adminuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = true
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "swedencentral"
      + max_bid_price                                          = -1
      + name                                                   = "lani3"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "cs2-servers"
      + size                                                   = "Standard_D4as_v4"
      + user_data                                              = (sensitive value)
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + admin_ssh_key {
          + public_key = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCvY9YBkn72I68uqx4xBElJaZNW/J69Yt/UcS6cGUKUjc5JVs4qYW5Mpn/c4gDWqeSupTb1DAb0sK50kSX+wUCqZH1P6RCSzM8/1rs2kwRcNvNEtqc8/S0hvz9aQunmBft/8YgmhvYGQiboUNkZQAWVlyvCS3lcDBdcq0YUzi4TAz35EcxlGsP2uTCuUGYpgsHIwYNvMYnRlOAzLXKszYf7xL1kwMz4xQDXZh+ggP2prcVCIRnaOBL18aiqaI+QLiVYZpx0qHRaMj2nvJ5goynus1iulrY3R0wmz8e6KkyGI4TfM+yoj0RKl9hfmq1jcXb+aer507s0l8tIqp26BLFQJv1vZjAIWiJ090C6dr/zkgKRVTh0+FsVEWxgC7O0epaUPTN0+Oxpi2itsW8TIm/rteturACLEcTza81ZUHbXZh38OzUaU0SaVpCPmOLn9F4rBXD6QkgWNdjOV8i+0A4u0/xFC1J1rmpINIJOe/llWK6+qkndIcN+4IlVg6Fw4IU= ekos@DESKTOP-QIMMA0H"
          + username   = "adminuser"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 50
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }
    }

  # module.virtual_machines["lani3"].azurerm_network_interface.game will be created
  + resource "azurerm_network_interface" "game" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "swedencentral"
      + mac_address                   = (known after apply)
      + name                          = "lani3-game-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "cs2-servers"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/cs2-servers/providers/Microsoft.Network/virtualNetworks/cs-network/subnets/internal"
        }
    }

  # module.virtual_machines["lani3"].azurerm_network_interface_security_group_association.example will be created
  + resource "azurerm_network_interface_security_group_association" "example" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/cs2-servers/providers/Microsoft.Network/networkSecurityGroups/allow_cs_connections"
    }

  # module.virtual_machines["lani3"].azurerm_public_ip.game will be created
  + resource "azurerm_public_ip" "game" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "swedencentral"
      + name                    = "lani3PublicIp1"
      + resource_group_name     = "cs2-servers"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
      + tags                    = {
          + "hostName" = "lani3"
        }
    }

  # module.virtual_machines["lani4"].azurerm_dns_a_record.game_record will be created
  + resource "azurerm_dns_a_record" "game_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "lani4"
      + records             = (known after apply)
      + resource_group_name = "cs2-servers"
      + ttl                 = 300
      + zone_name           = "pelit.ruut.me"
    }

  # module.virtual_machines["lani4"].azurerm_linux_virtual_machine.game will be created
  + resource "azurerm_linux_virtual_machine" "game" {
      + admin_username                                         = "adminuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = true
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "swedencentral"
      + max_bid_price                                          = -1
      + name                                                   = "lani4"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "cs2-servers"
      + size                                                   = "Standard_D4as_v4"
      + user_data                                              = (sensitive value)
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + admin_ssh_key {
          + public_key = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCvY9YBkn72I68uqx4xBElJaZNW/J69Yt/UcS6cGUKUjc5JVs4qYW5Mpn/c4gDWqeSupTb1DAb0sK50kSX+wUCqZH1P6RCSzM8/1rs2kwRcNvNEtqc8/S0hvz9aQunmBft/8YgmhvYGQiboUNkZQAWVlyvCS3lcDBdcq0YUzi4TAz35EcxlGsP2uTCuUGYpgsHIwYNvMYnRlOAzLXKszYf7xL1kwMz4xQDXZh+ggP2prcVCIRnaOBL18aiqaI+QLiVYZpx0qHRaMj2nvJ5goynus1iulrY3R0wmz8e6KkyGI4TfM+yoj0RKl9hfmq1jcXb+aer507s0l8tIqp26BLFQJv1vZjAIWiJ090C6dr/zkgKRVTh0+FsVEWxgC7O0epaUPTN0+Oxpi2itsW8TIm/rteturACLEcTza81ZUHbXZh38OzUaU0SaVpCPmOLn9F4rBXD6QkgWNdjOV8i+0A4u0/xFC1J1rmpINIJOe/llWK6+qkndIcN+4IlVg6Fw4IU= ekos@DESKTOP-QIMMA0H"
          + username   = "adminuser"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 50
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }
    }

  # module.virtual_machines["lani4"].azurerm_network_interface.game will be created
  + resource "azurerm_network_interface" "game" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "swedencentral"
      + mac_address                   = (known after apply)
      + name                          = "lani4-game-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "cs2-servers"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/cs2-servers/providers/Microsoft.Network/virtualNetworks/cs-network/subnets/internal"
        }
    }

  # module.virtual_machines["lani4"].azurerm_network_interface_security_group_association.example will be created
  + resource "azurerm_network_interface_security_group_association" "example" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/cs2-servers/providers/Microsoft.Network/networkSecurityGroups/allow_cs_connections"
    }

  # module.virtual_machines["lani4"].azurerm_public_ip.game will be created
  + resource "azurerm_public_ip" "game" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "swedencentral"
      + name                    = "lani4PublicIp1"
      + resource_group_name     = "cs2-servers"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
      + tags                    = {
          + "hostName" = "lani4"
        }
    }

Plan: 20 to add, 0 to change, 0 to destroy.
```
</details>